def count_maker(a):                   #функция подсчета появления знаков на восьми линиях игрового поля
    count = [0 for i in range(8)]
    for i in range(1, 4):
        for j in range(1, 4):
            if matrix[i][j] == a:
                count[i - 1] += 1     # подсчет по строкам игрового поля, запоминание количества в списке с 0 по 2
            if matrix[j][i] == a:
                count[2 + i] += 1     # подсчет по столбцам игрового поля, запоминание количества в списке с 3 по 5
            if matrix[i][j] == a and i == j:
                count[6] += 1         # подсчет по диагонали игрового поля, запоминание количества в списке индекс 6
            if matrix[i][j] == a and i + j == 4:
                count[7] += 1         # подсчет по диагонали игрового поля, запоминание количества в списке индекс 7
    result = [i // 3 for i in count]  # формирование матрицы с единицей (в случае выигрыша) и нолями
    return result                     # для проверки на истинность



gamer = ["крестики", "нолики"]
sign = ["x", "o"]
stop = 1                              # ограничитель количества ходов - 9
switch = 0                            # переключатель игрока
matrix = [
    [" ", "0", "1", "2"],
    ["0", "-", "-", "-"],
    ["1", "-", "-", "-"],
    ["2", "-", "-", "-"],
]
for i in matrix:                       # вывод начальной картинки
    for j in i:
        print(j, end=" ")
    print()

while True:
    print(f"Ходят {gamer[switch]}")
    str_num = input("Введите номер строки (0-2):  ")
    if len(str_num) > 1:                             # проверка количества введенных символов
        print("Введено больше одного символа.Повторим ввод полностью")
        continue
    if ord(str_num) < 48 or ord(str_num) > 50:       # проверка корректности введенного символа для 0-2
        print("Вы ввели неверный символ.Повторим ввод полностью")
        continue
    column_num = input("Введите номер столбца (0-2):  ")
    if len(column_num) > 1:                           # проверка количества введенных символов
        print("Введено больше одного символа.Повторим ввод полностью")
        continue
    if ord(column_num) < 48 or ord(column_num) > 50: # проверка корректности введенного символа 0-2
        print("Вы ввели неверный символ.Повторим ввод полностью")
        continue
    i = int(str_num) + 1                             #увеличение индекса на единицу, поскольку работа проводится
    j = int(column_num) + 1                          #в правой нижней матрице 3*3 матрицы 4*4

    if matrix[i][j] == "-":                          # проверка занятости клетки
        matrix[i][j] = sign[switch]                  # заполнение ячейки массива знаком соответствующего игрока
    else:
        print("Эта клетка занята. Повторите ввод")
        continue
    for i in matrix:                                 # вывод текущей картинки
        for j in i:
            print(j, end=" ")
        print()

    if any(count_maker(sign[switch])):               # проверка на возникновение трех одинаковых знаков на одной
        print(f"Победили {gamer[switch]}")           # из линий игрового поля
        break
    if stop == 9:
        print("Ничья")
        break

    switch = (switch + 1) % 2                         # переключатель игрока 0/1
    stop += 1                                         # обновление счетчика ходов
   
