S = 0  # это наша переменная-счетчик, в которой мы будем считать сумму чисел
n = 1  # текущее натуральное число, с которого начинаем складывать натуральные числа

# заводим цикл while, который будет работать пока сумма не превысит 500
while S < 500:  # делай пока ...
    S += n  # увеличиваем сумму, равносильно S = S + n
    n += 1  # так как сумма ещё не достигла нужного значения, то увеличиваем переменную счетчик
    print("Ещё считаю ...")

print("Сумма равна: ", S)
print("Количество чисел: ", n-1)
